## Import the libary and read the file

In [89]:
import pandas as pd
BC = pd.read_csv("balance.csv") 
BC.head()

   Customer_ID Customer_Name Gender  Balance  Deposite
0            1            Ah      F      500        80
1            2            Ab      F      340        82
2            3            Ah      F     3000        81
3            4            Ab      M      200       120
4            5            Ah      M      120       300

## show the head of the file first 5 culoms

In [90]:
BC.head()

   Customer_ID Customer_Name Gender  Balance  Deposite
0            1            Ah      F      500        80
1            2            Ab      F      340        82
2            3            Ah      F     3000        81
3            4            Ab      M      200       120
4            5            Ah      M      120       300

## show the last 5 culoms

In [91]:
BC.tail()

    Customer_ID Customer_Name Gender  Balance  Deposite
33           34            Ab      F     3000        64
34           35            Ah      F      200        67
35           36            Ab      F      120        67
36           37            Ah      M      500        68
37           38            Ab      F      123        70

## print the first 4 items we use .head

In [92]:
BC.head(4)

   Customer_ID Customer_Name Gender  Balance  Deposite
0            1            Ah      F      500        80
1            2            Ab      F      340        82
2            3            Ah      F     3000        81
3            4            Ab      M      200       120

## print the last 10 items we use .tail

In [93]:
BC.tail(10)

    Customer_ID Customer_Name Gender  Balance  Deposite
28           29            Ah      F      200        65
29           30            Ab      F      120        67
30           31            Ah      F      500        66
31           32            Ab      F      123        67
32           33            Ah      F      435        65
33           34            Ab      F     3000        64
34           35            Ah      F      200        67
35           36            Ab      F      120        67
36           37            Ah      M      500        68
37           38            Ab      F      123        70

## change the name of colums
# Customer_ID to ID

In [94]:
BC.head()

   Customer_ID Customer_Name Gender  Balance  Deposite
0            1            Ah      F      500        80
1            2            Ab      F      340        82
2            3            Ah      F     3000        81
3            4            Ab      M      200       120
4            5            Ah      M      120       300

In [95]:
BC.rename(columns= {"Customer_ID" : "ID"}, inplace=True)
BC.head()

   ID Customer_Name Gender  Balance  Deposite
0   1            Ah      F      500        80
1   2            Ab      F      340        82
2   3            Ah      F     3000        81
3   4            Ab      M      200       120
4   5            Ah      M      120       300

In [83]:
BC.head()

   ID Customer_Name Gender  Balance  Deposite
0   1            Ah      F      500        80
1   2            Ab      F      340        82
2   3            Ah      F     3000        81
3   4            Ab      M      200       120
4   5            Ah      M      120       300

## Remove a specific Columns
# delete the coloum Gemder

In [85]:
BC1 = BC.drop(["Customer_Name"], axis=1)
BC1.head()

   ID Gender  Balance  Deposite
0   1      F      500        80
1   2      F      340        82
2   3      F     3000        81
3   4      M      200       120
4   5      M      120       300

In [74]:
BC.head()

   ID Customer_Name Gender  Balance  Deposite  Total Balance
0   1            Ah      F      500        80         596.10
1   2            Ab      F      340        82         433.36
2   3            Ah      F     3000        81        3172.13
3   4            Ab      M      200       120         328.30
4   5            Ah      M      120       300         431.30

In [62]:
BC1.head()

   ID Gender  Balance  Deposite
0   1      F      500        80
1   2      F      340        82
2   3      F     3000        81
3   4      M      200       120
4   5      M      120       300

## Perform arithmetic operations on the df
# create a new colum that contains the sum of the Balance and Deposite

In [63]:
BC["Total Balance"]= BC["Balance"]+BC["Deposite"]
BC.head()

   ID Customer_Name Gender  Balance  Deposite  Total Balance
0   1            Ah      F      500        80            580
1   2            Ab      F      340        82            422
2   3            Ah      F     3000        81           3081
3   4            Ab      M      200       120            320
4   5            Ah      M      120       300            420

## Find statistical measures (mean , median , mode)
# Find the mean of the Balance

In [64]:
av = BC["Balance"].mean()
av

1611.0

# Find the median of the Balance

In [65]:
av = BC["Balance"].median()
av

387.5

# Find the mode of the Balance

In [66]:
av = BC["Balance"].mode(0)
av

0    500
Name: Balance, dtype: int64

## Find the std ,min , Max
# find the std of Total

In [67]:
st = BC["Total Balance"].std()
st

5577.665516103542

# find the Min of Total

In [68]:
st = BC["Total Balance"].min()
st

186

# find the Max of Total

In [69]:
st = BC["Total Balance"].max()
st

34615

## Examples
# add 3 percent to the total amounts

In [70]:
BC.head()

   ID Customer_Name Gender  Balance  Deposite  Total Balance
0   1            Ah      F      500        80            580
1   2            Ab      F      340        82            422
2   3            Ah      F     3000        81           3081
3   4            Ab      M      200       120            320
4   5            Ah      M      120       300            420

In [71]:
BC["Total Balance"]=BC["Total Balance"]+0.03*BC["Total Balance"]
BC.head()

   ID Customer_Name Gender  Balance  Deposite  Total Balance
0   1            Ah      F      500        80         597.40
1   2            Ab      F      340        82         434.66
2   3            Ah      F     3000        81        3173.43
3   4            Ab      M      200       120         329.60
4   5            Ah      M      120       300         432.60

## Add or Subtract
# Add to the Total

In [72]:
BC["Total Balance"]= BC["Total Balance"] - 0.8
BC.head()

   ID Customer_Name Gender  Balance  Deposite  Total Balance
0   1            Ah      F      500        80         596.60
1   2            Ab      F      340        82         433.86
2   3            Ah      F     3000        81        3172.63
3   4            Ab      M      200       120         328.80
4   5            Ah      M      120       300         431.80

# Subtract from the Total 0.5

In [73]:
BC["Total Balance"]= BC["Total Balance"] - 0.5
BC.head()

   ID Customer_Name Gender  Balance  Deposite  Total Balance
0   1            Ah      F      500        80         596.10
1   2            Ab      F      340        82         433.36
2   3            Ah      F     3000        81        3172.13
3   4            Ab      M      200       120         328.30
4   5            Ah      M      120       300         431.30